OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/heatTransfer/chtMultiRegionSimpleFoam/cpuCabinet/0.orig/v_fins/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    v_fins_to_domain0
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        qrNbr           none;
        qr              none;
        Tnbr            T;
        kappaMethod     solidThermo;
        useImplicit     true;
        value           $internalField;
    }

    v_fins_to_v_CPU
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        qrNbr           none;
        qr              none;
        Tnbr            T;
        kappaMethod     solidThermo;
        useImplicit     true;
        value           $internalField;
    }
}

// ************************************************************************* //
